e0 = [x*c | [x] <- [[1], [2, 3]], let c = 123];

f x y = case (x, y) of {
    (0, 0) -> -1;
    (x, b) -> 1;
};

fixx :: (a -> a) -> a;
fixx f = let {x = (f x);} in x;

f2 = let {x=2; y = 5 + x;} in x+y; -- не корректно транслируется
f3 = let {x = 2;} in let {y = 5+x;} in x+y; -- во что должно преобрабоваться после анализа зависимостей


-- модульное тестирование
-- анализ зависимостей
-- *в грамматику добавить возможность писать просто выражения (если есть взаимная рекурсия глобальных определений, то объединять их в let в выражении где они используются)
-- *рефакторинг грамматики
-- *зависимость от отступов вместо блоков и сепараторов

-- Вопросы:
-- 1. Что делать с АДТ?