concatMap :: (a -> [b]) -> [a] -> [b];
concatMap f [] = [];
concatMap f (x:xs) = (f x) ++ (concatMap f xs);  

f1 = let {x=2; y = 5 + x;} in x+y; -- не корректная трансляция (нужен граф зависимостей) 
f2 = let {
    even 0 = (True);
    even n = (odd (n-1));

    odd 0 = (False);
    odd n = (even (n-1));
} in (odd 3); -- транслируется корректно, но нужно что то делать с кортежем (он не ленивый в Haskell; можно перед кортежем ставить ленивый паттерн ~)

data Maybe a = Just a | Nothing;

fact 0 = 1;
fact n = n * (fact (n-1)); -- все ОК

--+ if -> case
--+ List -> :
--+ List pattern -> :
--+ case -> FATBAR
--+ let and where -> application with fix
--+ string -> constructor with list of char arg
--+ char -> constructor with ascii code
--+ list comprehension
--+ operator (++)

--+ fix по необходимости не только для let и where, но и в глобальных определениях
--+ исправить порядок определений (он неправильный из за unordered_map) 
-- нужно переименовывать имена всех локальных определений и их вызовы (... -> Parser -> Renamer -> StaticAnalyze -> ...)
-- исправить грамматику (добавить поддержку паттернов) для list comprehension
-- *граф зависимостей в области локальных определений (это модуль оптимизаций, после IRGen + в IRGen нужно все where транслировать в let + Translator будет различать только let и letrec)
-- *в грамматику добавить возможность писать просто выражения (=> если есть взаимная рекурсия глобальных определений, то объединять их в let в выражении где они используются)

Вопросы:
1. Было бы удобно использовать case-of вместо FATBAR, т.к. можно тестить в Haskell. Или вообще отказаться от FATBAR?
2. Что делать с АДТ?
3. Как правильно транслировать LETREC с 2 и более локальными определениями (если они, например, связаны взаимной рекурсией)?